# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
#Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое 
#количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# *Пример:*

# 6 -> 1  4  1
# 24 -> 4  16  4
#     60 -> 10  40  10
# если получается некорректное разделение - напечатать "Неверное S"

n = int(input('Количество журавликов: '))
if n % 6 == 0:
    s = (n // 6)
    p = s
    k = 2 * (2 * (n // 6))
    print(f'Сережа сделал {s}, Петя сделал {p}, Катя сделала {k}')
else:
    print('Неверное количество журавликов')